# Data Manipulation Using Pandas

In [10]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [3]:
# Series - similar to a Numpy array. 
# Create a series from lists,array and dictionary 

label=['a','b','c'] #List
my_list=[10,20,30]
arr=np.array([10,20,30])#Array
d={'a':10,'b':20,'c':30}#Dictionary

In [4]:
#Create a series from the list
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
#Create a series with labels as axis
pd.Series(data=my_list,index=label)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
#Series Indexing
Ser1=pd.Series([1,2,3,4],index=['USA','GER','USSR','Kenya'])
Ser1

USA      1
GER      2
USSR     3
Kenya    4
dtype: int64

In [9]:
Ser1['USA']

1

#### DataFrames - Is a collection of many series objects put together but sharing the same index.

In [12]:
#Create a Dataframe 
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [13]:
#Selection of a single column 
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [14]:
#To show the column is a series 
type(df['W'])

pandas.core.series.Series

In [16]:
#Selecting a list of columns 
df[['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [18]:
#Adding a new column 
df['new']=df['X']+df['Y']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [19]:
#Dropping columns (along axis =1)
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [20]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.012363
B -0.134841  0.390528  0.166905  0.184502  0.557432
C  0.807706  0.072960  0.638787  0.329646  0.711747
D -0.497104 -0.754070 -0.943406  0.484752 -1.697476
E -0.116773  1.901755  0.238127  1.996652  2.139882

In [21]:
#Used in place to effect the changes 
#This code can only be run once//otherwise you get an error
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
#Drop rows (along axis=0)
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [23]:
#LOC AND ILOC
#LOC uses axis lables 
#ILOC uses the index(by default dataframes are indexed from 0)

In [24]:
#Selecting rows using a label 
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [25]:
#Selecting rows using the index
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [26]:
#Selecting a subset of rows and columns 
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [27]:
#Conditional Selection 
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [28]:
#Where less than zero is represented by nulls.
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

### Indexing and Reseting Index

In [29]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
#Reseting an Index 
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [31]:
#Creating an Index 
newind='KEN UG TZ RW BR'.split()

In [32]:
#Create a new Column 
df['Country']=newind
df

          W         X         Y         Z Country
A  0.302665  1.693723 -1.706086 -1.159119     KEN
B -0.134841  0.390528  0.166905  0.184502      UG
C  0.807706  0.072960  0.638787  0.329646      TZ
D -0.497104 -0.754070 -0.943406  0.484752      RW
E -0.116773  1.901755  0.238127  1.996652      BR

In [33]:
#Setting a different column as an index 
df.set_index('Country')

                W         X         Y         Z
Country
KEN      0.302665  1.693723 -1.706086 -1.159119
UG      -0.134841  0.390528  0.166905  0.184502
TZ       0.807706  0.072960  0.638787  0.329646
RW      -0.497104 -0.754070 -0.943406  0.484752
BR      -0.116773  1.901755  0.238127  1.996652

In [34]:
#to effect the change; 
df.set_index('Country',inplace=True)
df

                W         X         Y         Z
Country
KEN      0.302665  1.693723 -1.706086 -1.159119
UG      -0.134841  0.390528  0.166905  0.184502
TZ       0.807706  0.072960  0.638787  0.329646
RW      -0.497104 -0.754070 -0.943406  0.484752
BR      -0.116773  1.901755  0.238127  1.996652

#### Handling Missing Values

In [35]:
df>0

             W      X      Y      Z
Country
KEN       True   True  False  False
UG       False   True   True   True
TZ        True   True   True   True
RW       False  False  False   True
BR       False   True   True   True

In [36]:
df=df[df>0]
df

                W         X         Y         Z
Country
KEN      0.302665  1.693723       NaN       NaN
UG            NaN  0.390528  0.166905  0.184502
TZ       0.807706  0.072960  0.638787  0.329646
RW            NaN       NaN       NaN  0.484752
BR            NaN  1.901755  0.238127  1.996652

In [37]:
#to get to understand a dataset; no of columns/rows/data types/non nulls
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, KEN to BR
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       2 non-null      float64
 1   X       4 non-null      float64
 2   Y       3 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [38]:
#to know if a column has atleast 1 null value.
df.isnull().any()

W    True
X    True
Y    True
Z    True
dtype: bool

In [39]:
#if the whole column has null values it returns TRUE;otherwise FALSE
df.isnull().all()

W    False
X    False
Y    False
Z    False
dtype: bool

In [40]:
#To know the no. of null values on each column.
df.isnull().sum()

W    3
X    1
Y    2
Z    1
dtype: int64

#### Dropping NULLS

In [41]:
#Dropping all nulls 
df.dropna()

                W        X         Y         Z
Country
TZ       0.807706  0.07296  0.638787  0.329646

In [42]:
#Drop along rows(axis=0)
df.dropna(axis=0)

                W        X         Y         Z
Country
TZ       0.807706  0.07296  0.638787  0.329646

In [43]:
#Drop across columns
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [KEN, UG, TZ, RW, BR]

In [44]:
#Inputing Missing Values 
df.fillna(value='FILL VALUE')

                  W           X           Y           Z
Country
KEN        0.302665    1.693723  FILL VALUE  FILL VALUE
UG       FILL VALUE    0.390528    0.166905    0.184502
TZ         0.807706     0.07296    0.638787    0.329646
RW       FILL VALUE  FILL VALUE  FILL VALUE    0.484752
BR       FILL VALUE    1.901755    0.238127    1.996652

In [46]:
#Inputing the missing values with mean
df1=df.fillna(value=df['W'].mean())
df1

                W         X         Y         Z
Country
KEN      0.302665  1.693723  0.555186  0.555186
UG       0.555186  0.390528  0.166905  0.184502
TZ       0.807706  0.072960  0.638787  0.329646
RW       0.555186  0.555186  0.555186  0.484752
BR       0.555186  1.901755  0.238127  1.996652

### GROUPBY

In [51]:
#Create a dataframe
Company=['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB']
Person=['Joy','Sam','Sarah','Amy','Vanessa','Bruce']
Sales=[200,300,400,500,600,700]

comp_series=pd.Series(Company)
Pers_series=pd.Series(Person)
Sales_series=pd.Series(Sales)

data={'Company':comp_series, 'Person':Pers_series,'Sales':Sales_series}

In [52]:
df3=pd.DataFrame(data,index=[0,1,2,3,4,5])
df3

  Company   Person  Sales
0  GOOGLE      Joy    200
1  GOOGLE      Sam    300
2    MSFT    Sarah    400
3    MSFT      Amy    500
4      FB  Vanessa    600
5      FB    Bruce    700

In [55]:
#GROUP by Company 
Comp=df3.groupby('Company')
Comp

In [56]:
#Average
Comp.mean()

         Sales
Company
FB         650
GOOGLE     250
MSFT       450

In [57]:
#Minimum Value 
Comp.max()

          Person  Sales
Company
FB       Vanessa    700
GOOGLE       Sam    300
MSFT       Sarah    500

In [58]:
#No. of rows and columns 
df3.shape

(6, 3)

In [59]:
#Numerical Discriptive stats 
df3.describe()

            Sales
count    6.000000
mean   450.000000
std    187.082869
min    200.000000
25%    325.000000
50%    450.000000
75%    575.000000
max    700.000000

In [60]:
#Non-numerical descriptive stats
df3.describe(include='all')

       Company Person       Sales
count        6      6    6.000000
unique       3      6         NaN
top         FB  Sarah         NaN
freq         2      1         NaN
mean       NaN    NaN  450.000000
std        NaN    NaN  187.082869
min        NaN    NaN  200.000000
25%        NaN    NaN  325.000000
50%        NaN    NaN  450.000000
75%        NaN    NaN  575.000000
max        NaN    NaN  700.000000